; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p6---int100n150-m25---int100c200---s105---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level13 level13)
(sum level0 level16 level16)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level13 level14)
(sum level1 level16 level17)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level13 level15)
(sum level2 level16 level18)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level13 level16)
(sum level3 level16 level19)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level13 level17)
(sum level4 level16 level20)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level13 level18)
(sum level5 level16 level21)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level13 level19)
(sum level6 level16 level22)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level13 level20)
(sum level7 level16 level23)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level13 level21)
(sum level8 level16 level24)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level13 level22)
(sum level9 level16 level25)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level13 level23)
(sum level10 level16 level26)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level13 level24)
(sum level11 level16 level27)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level13 level25)
(sum level12 level16 level28)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level13 level26)
(sum level13 level16 level29)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level13 level27)
(sum level14 level16 level30)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level13 level28)
(sum level15 level16 level31)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level13 level29)
(sum level16 level16 level32)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level13 level30)
(sum level17 level16 level33)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level13 level31)
(sum level18 level16 level34)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level13 level32)
(sum level19 level16 level35)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level13 level33)
(sum level20 level16 level36)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level13 level34)
(sum level21 level16 level37)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level13 level35)
(sum level22 level16 level38)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level13 level36)
(sum level23 level16 level39)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level13 level37)
(sum level24 level16 level40)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level13 level38)
(sum level25 level16 level41)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level13 level39)
(sum level26 level16 level42)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level13 level40)
(sum level27 level16 level43)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level13 level41)
(sum level28 level16 level44)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level13 level42)
(sum level29 level16 level45)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level13 level43)
(sum level30 level16 level46)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level13 level44)
(sum level31 level16 level47)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level13 level45)
(sum level32 level16 level48)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level13 level46)
(sum level33 level16 level49)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level13 level47)
(sum level34 level16 level50)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level13 level48)
(sum level35 level16 level51)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level13 level49)
(sum level36 level16 level52)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level13 level50)
(sum level37 level16 level53)
(sum level37 level24 level61)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level13 level51)
(sum level38 level16 level54)
(sum level38 level24 level62)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level13 level52)
(sum level39 level16 level55)
(sum level39 level24 level63)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level13 level53)
(sum level40 level16 level56)
(sum level40 level24 level64)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level13 level54)
(sum level41 level16 level57)
(sum level41 level24 level65)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level13 level55)
(sum level42 level16 level58)
(sum level42 level24 level66)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level13 level56)
(sum level43 level16 level59)
(sum level43 level24 level67)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level13 level57)
(sum level44 level16 level60)
(sum level44 level24 level68)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level13 level58)
(sum level45 level16 level61)
(sum level45 level24 level69)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level13 level59)
(sum level46 level16 level62)
(sum level46 level24 level70)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level13 level60)
(sum level47 level16 level63)
(sum level47 level24 level71)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level13 level61)
(sum level48 level16 level64)
(sum level48 level24 level72)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level13 level62)
(sum level49 level16 level65)
(sum level49 level24 level73)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level13 level63)
(sum level50 level16 level66)
(sum level50 level24 level74)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level13 level64)
(sum level51 level16 level67)
(sum level51 level24 level75)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level13 level65)
(sum level52 level16 level68)
(sum level52 level24 level76)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level13 level66)
(sum level53 level16 level69)
(sum level53 level24 level77)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level13 level67)
(sum level54 level16 level70)
(sum level54 level24 level78)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level13 level68)
(sum level55 level16 level71)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level13 level69)
(sum level56 level16 level72)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level13 level70)
(sum level57 level16 level73)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level13 level71)
(sum level58 level16 level74)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level13 level72)
(sum level59 level16 level75)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level13 level73)
(sum level60 level16 level76)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level13 level74)
(sum level61 level16 level77)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level13 level75)
(sum level62 level16 level78)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level13 level76)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level13 level77)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level13 level78)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level7 level78)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level77 level1 level78)

(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l0 l3)
(fuelcost level13 l0 l3)
(connected l0 l5)
(fuelcost level24 l0 l5)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l1 l4)
(fuelcost level2 l1 l4)
(connected l1 l5)
(fuelcost level8 l1 l5)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)
(connected l2 l4)
(fuelcost level16 l2 l4)
(connected l3 l0)
(fuelcost level13 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l5)
(fuelcost level3 l3 l5)
(connected l4 l1)
(fuelcost level2 l4 l1)
(connected l4 l2)
(fuelcost level16 l4 l2)
(connected l5 l0)
(fuelcost level24 l5 l0)
(connected l5 l1)
(fuelcost level8 l5 l1)
(connected l5 l3)
(fuelcost level3 l5 l3)

(at t0 l2)
(fuel t0 level78)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l0)
(at p3 l5)
(at p4 l0)
(at p5 l3)
)

(:goal
(and
(at p0 l4)
(at p1 l2)
(at p2 l4)
(at p3 l0)
(at p4 l5)
(at p5 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l0 level77 level1 level78)
   deleted: (at t0 l2) (fuel t0 level78)
   added: (at t0 l0) (fuel t0 level77)
   goals met: 0 of 6
2. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 6
3. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 6
4. (drive t0 l0 l3 level64 level13 level77)
   deleted: (at t0 l0) (fuel t0 level77)
   added: (at t0 l3) (fuel t0 level64)
   goals met: 0 of 6
5. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 6
6. (drive t0 l3 l1 level57 level7 level64)
   deleted: (at t0 l3) (fuel t0 level64)
   added: (at t0 l1) (fuel t0 level57)
   goals met: 0 of 6
7. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 1 of 6
8. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 6
9. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 6
10. (drive t0 l1 l5 level49 level8 level57)
   deleted: (at t0 l1) (fuel t0 level57)
   added: (at t0 l5) (fuel t0 level49)
   goals met: 1 of 6
11. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 1 of 6
12. (unload p4 t0 l5)
   deleted: (in p4 t0)
   added: (at p4 l5)
   goals met: 2 of 6
13. (drive t0 l5 l0 level25 level24 level49)
   deleted: (at t0 l5) (fuel t0 level49)
   added: (at t0 l0) (fuel t0 level25)
   goals met: 2 of 6
14. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 6
15. (drive t0 l0 l2 level24 level1 level25)
   deleted: (at t0 l0) (fuel t0 level25)
   added: (at t0 l2) (fuel t0 level24)
   goals met: 3 of 6
16. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 4 of 6
17. (drive t0 l2 l4 level8 level16 level24)
   deleted: (at t0 l2) (fuel t0 level24)
   added: (at t0 l4) (fuel t0 level8)
   goals met: 4 of 6
18. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 5 of 6
19. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 6 of 6
